In [4]:
import numpy as np
import pandas as pd
s1 = pd.Series([7.3, -2.5, 3.4, 1.5],index=['a','b','c','d'])
s2 = pd.Series([-2.1, 3.6, -1.5, 3.1],index=['b','a','c','d'])
s1

a    7.3
b   -2.5
c    3.4
d    1.5
dtype: float64

In [5]:
s2

b   -2.1
a    3.6
c   -1.5
d    3.1
dtype: float64

In [6]:
s1 + s2

a    10.9
b    -4.6
c     1.9
d     4.6
dtype: float64

In [7]:
s1 = pd.Series([7.3, -2.5, np.nan, 1.5],index=['a','b','c','d'])
s2 = pd.Series([-2.1, 3.6, -1.5, 3.1],index=['b','a','c','d'])
s1

a    7.3
b   -2.5
c    NaN
d    1.5
dtype: float64

In [8]:
s2

b   -2.1
a    3.6
c   -1.5
d    3.1
dtype: float64

In [9]:
s1+s2

a    10.9
b    -4.6
c     NaN
d     4.6
dtype: float64

In [12]:
df1 = pd.DataFrame(np.arange(9.0).reshape(3,3),
                   columns = list('bcd'),
                   index=['台北','台中','台南']
                  )
df1

      b    c    d
台北  0.0  1.0  2.0
台中  3.0  4.0  5.0
台南  6.0  7.0  8.0

In [13]:
df2 = pd.DataFrame(np.arange(9.0).reshape(3,3),
                   columns = list('bcd'),
                   index=['台北','台中','台南']
                  )
df2

      b    c    d
台北  0.0  1.0  2.0
台中  3.0  4.0  5.0
台南  6.0  7.0  8.0

In [14]:
df1 + df2

       b     c     d
台北   0.0   2.0   4.0
台中   6.0   8.0  10.0
台南  12.0  14.0  16.0

In [15]:
df2 = pd.DataFrame(np.arange(6.0).reshape(2,3),
                   columns = list('bcd'),
                   index=['台北','台中']
                  )
df2

      b    c    d
台北  0.0  1.0  2.0
台中  3.0  4.0  5.0

In [16]:
df1

      b    c    d
台北  0.0  1.0  2.0
台中  3.0  4.0  5.0
台南  6.0  7.0  8.0

In [17]:
df1+df2

      b    c     d
台中  6.0  8.0  10.0
台北  0.0  2.0   4.0
台南  NaN  NaN   NaN

In [18]:
#擴展方式
df1.add(df2,fill_value=0)

      b    c     d
台中  6.0  8.0  10.0
台北  0.0  2.0   4.0
台南  6.0  7.0   8.0

In [21]:
df1 / 2 + 2

      b    c    d
台北  2.0  2.5  3.0
台中  3.5  4.0  4.5
台南  5.0  5.5  6.0

In [22]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('abc'),
                     index=['高雄','台北','台中','台南'])
frame

      a     b     c
高雄  0.0   1.0   2.0
台北  3.0   4.0   5.0
台中  6.0   7.0   8.0
台南  9.0  10.0  11.0

In [23]:
series = frame.iloc[0]
series

a    0.0
b    1.0
c    2.0
Name: 高雄, dtype: float64

In [24]:
#廣播模式
frame - series

      a    b    c
高雄  0.0  0.0  0.0
台北  3.0  3.0  3.0
台中  6.0  6.0  6.0
台南  9.0  9.0  9.0

In [25]:
#sort_index,sort_values()
#rank()
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [26]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [28]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                    index = ['three', 'one'],
                    columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [29]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [30]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [33]:
obj = pd.Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [34]:
obj.sort_values(ascending=False)

1    7
0    4
3    2
2   -3
dtype: int64

In [35]:
frame = pd.DataFrame({'b':[4, 7, -3, 2], 'a':[0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [36]:
frame.sort_values(by='a')

   b  a
0  4  0
2 -3  0
1  7  1
3  2  1

In [37]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [38]:
#排名
#rank()
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [39]:
obj.rank(method='max')

0    7.0
1    1.0
2    7.0
3    5.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [43]:
obj.rank(method='min').sort_values(ascending=False)

0    6.0
2    6.0
3    4.0
6    4.0
4    3.0
5    2.0
1    1.0
dtype: float64

In [44]:
frame = pd.DataFrame({'b':[4.3, 7, -3, 2],
                     'a':[0, 1, 0,1],
                     'c':[-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [47]:
frame.sort_index(axis=1).rank(axis=1,method='min')

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0